Обработки/Reports/_КонтрольЛимитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_КонтрольЛимитов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНКДВСуммеСделок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетаДоверительногоУправления</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыДоговоровДоверительногоУправления</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_КонтрольЛимитов/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	ТД = ТекущаяДата();
	
	Отчет.Период.ДатаНачала		= НачалоКвартала(ТД);
	Отчет.Период.ДатаОкончания	= ТД;
	Отчет.Организация	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗначениеВСписок(Список, Значение)
	
	НовыйЭлемент = Список.Добавить(Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура СДУИВидыДДУПриИзменении(Элемент)
	
	Отчет.СчетаДоверительногоУправления.Очистить();
	Отчет.ВидыДоговоровДоверительногоУправления.Очистить();
	
	Для Каждого ТекЭлемент Из СДУИВидыДДУ Цикл
		
		Если ТипЗнч(ТекЭлемент.Значение) = Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда
			ДобавитьЗначениеВСписок(Отчет.СчетаДоверительногоУправления, ТекЭлемент.Значение);
		ИначеЕсли ТипЗнч(ТекЭлемент.Значение) = Тип("ПеречислениеСсылка.ВидыДоговоровДоверительногоУправления") Тогда
			ДобавитьЗначениеВСписок(Отчет.ВидыДоговоровДоверительногоУправления, ТекЭлемент.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";

	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период", Отказ);
	КонецЕсли;

КонецПроцедуры
